In [8]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy

In [9]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [10]:
train_df.dtypes

date     object
store     int64
item      int64
sales     int64
dtype: object

In [11]:
train_df.head()

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [12]:
test_df.tail()

          id        date  store  item
44995  44995  2018-03-27     10    50
44996  44996  2018-03-28     10    50
44997  44997  2018-03-29     10    50
44998  44998  2018-03-30     10    50
44999  44999  2018-03-31     10    50

In [13]:
train_df['trsin_or_test'] , test_df['trsin_or_test'] = 'train' , 'test'
data_df = pd.concat([train_df,test_df])
data_df.head()

         date  store  item  sales trsin_or_test  id
0  2013-01-01      1     1   13.0         train NaN
1  2013-01-02      1     1   11.0         train NaN
2  2013-01-03      1     1   14.0         train NaN
3  2013-01-04      1     1   13.0         train NaN
4  2013-01-05      1     1   10.0         train NaN